Revit 2024 API
ExternalGeometryId.GetHashCode Method
 Gets the hash code.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public override int GetHashCode()
Visual Basic
Public Overrides Function GetHashCode As Integer
Visual C++
public:
virtual int GetHashCode() override
See Also
ExternalGeometryId Class
Autodesk.Revit.DB Namespace